Terraform Plan Output:
```
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-srijan-sadhu]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=f1eb70a1-a7e2-4900-b1f7-856ca32da494]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-srijan-sadhu]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_d40d1767-dac7-455a-8484-68337d5b2ecd.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-srijan-sadhu:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-srijan-sadhu]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-srijan-sadhu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "hello-kitty-function-srijan-sadhu"
        tags                           = {
            "appstack"  = "hello-kitty"
            "component" = "hello-kitty"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "srijan_sadhu_15" -> "srijan-sadhu-15"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-srijan-sadhu-15"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "f1eb70a1-a7e2-4900-b1f7-856ca32da494"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "srijan-sadhu-15"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "hello-kitty"
          + "component" = "hello-kitty"
        }
      + tags_all                    = {
          + "appstack"  = "hello-kitty"
          + "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "f1eb70a1-a7e2-4900-b1f7-856ca32da494"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_d0e7f04c-e6c6-4ab3-ac26-522d6627301d.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-srijan-sadhu"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + aws_s3_srijan_sadhu_15_arn                                                 = (known after apply)
  + aws_s3_srijan_sadhu_15_bucket_name                                         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```